-- 玩法介绍配置 
cc.exports.MJRules = {}

-- 规则说明(编号跟服务器一一对应)
MJRules.Rules = {
    [1] = {name = "，报听",          des = "<#ff0000><30>【报听】<#46200F><30>玩家勾选选项后，需要先报听才可以胡牌。"}, 
    [2] = {name = "，带风",          des = "<#ff0000><30>【带风】<#46200F><30>玩家勾选选项后，游戏所需牌数为带风字牌的136张。"},
    [3] = {name = "，只可自摸胡",     des = "<#ff0000><30>【只可自摸胡】<#46200F><30>玩家勾选选项后，只可以自摸胡牌，不能接炮胡牌。"}, 
    [4] = {name = "，清一色加番",     des = "<#ff0000><30>【清一色加番】<#46200F><30>玩家勾选选项后，胡牌牌型为一条龙时，结算加番。"},
	[5] = {name = "，一条龙加番",     des = "<#ff0000><30>【一条龙加番】<#46200F><30>玩家勾选选项后，胡牌牌型为一条龙时，结算加番。"},
	[6] = {name = "，随机耗子",        des = "<#ff0000><30>【随机耗子】<#46200F><30>玩家勾选选项后，玩法增加耗子牌（随机）。"},
	[7] = {name = "，过胡只可自摸",   des = "<#ff0000><30>【过胡只可自摸】<#46200F><30>玩家勾选选项后，玩家遇到胡点过之后，只能自摸胡。"},  
    [8] = {name = "，抢杠胡",        des = "<#ff0000><30>【抢杠胡】<#46200F><30>玩家勾选选项后，抢杠胡算点炮。"},       
    [9] = {name = "，荒庄不荒杠",      des = "<#ff0000><30>【荒庄不荒杠】<#46200F><30>如果一局荒庄了，杠分依然计算。"}, 

    [10] = {name = "，未上听杠不算分",  des = "<#ff0000><30>【未上听杠不算分】<#46200F><30>玩家勾选选项后，玩家杠牌但是没有听牌，则杠不算钱。"}, 
    [11] = {name = "，一炮多响",       des = "<#ff0000><30>【一炮多响】<#46200F><30>玩家勾选选项后，一人点炮可多人接炮胡。"},   
    [12] = {name = "，听牌可杠",       des = "<#ff0000><30>【听牌可杠】<#46200F><30>勾选选项后，玩家在不改变的听口的前提条件下可以杠牌。"},
    [13] = {name = "，七小对",         des = "<#ff0000><30>【七小对】<#46200F><30>勾选选项后，增加七小对的胡牌类型。"},
    [14] = {name = "，只有胡牌玩家杠算分",  des = "<#ff0000><30>【杠随胡家】<#46200F><30>勾选选项后，只有胡牌玩家的杠结算钱，不勾选则所有的杠都结算。"},
    [15] = {name = "，风一色",         des = "<#ff0000><30>【风一色】<#46200F><30>勾选选项后，增加风一色的胡牌类型。"},
    [16] = {name = "，清一色",         des = "<#ff0000><30>【清一色】<#46200F><30>勾选选项后，增加清一色的胡牌类型。"},

    -- [17] = {name = "，凑一色",          des = "<#ff0000><30>【凑一色】<#46200F><30>勾选选项后，增加凑一色的胡牌类型。"},
    [17] = {name = "，色牌",          des = "<#ff0000><30>【色牌】<#46200F><30>色牌：勾选选项后，玩法增加色牌。"}, 
    [18] = {name = "，暗杠可见",        des = "<#ff0000><30>【暗杠可见】<#46200F><30>勾选选项后，其他玩家可以看到暗杠玩家杠的是什么牌。"},
    [19] = {name = "，十三幺",          des = "<#ff0000><30>【十三幺】<#46200F><30>勾选选项后，增加十三幺的胡牌类型。"},
	[20] = {name = "，一条龙",          des = "<#ff0000><30>【一条龙】<#46200F><30>勾选选项后，增加一条龙的胡牌类型。"},
	[21] = {name = "，4金",            des = "<#ff0000><30>【四金】<#46200F><30>选择此选项后，游戏中有一种金牌，共4张金。"},
    [22] = {name = "，8金",             des = "<#ff0000><30>【八金】<#46200F><30>选择此选项后，游戏中有一种金牌，共8张金。"},
    [23] = {name = "，上金少者只可自摸",  des = "<#ff0000><30>【上金少者只可自摸】<#46200F><30>玩家中，上金最少的玩家只能自摸胡。"},	
    [24] = {name = "，边坎吊",          des = "<#ff0000><30>【边坎吊】<#46200F><30>玩家勾选选项后，玩法增加边坎吊。"},
    [28] = {name = "，庄家加2分",          des = "<#ff0000><30>【庄家加2分】<#46200F><30>庄家加2分：庄家输赢都多2分。"},
    [34] = {name = "，色牌",          des = "<#ff0000><30>【色牌】<#46200F><30>色牌：只能色牌才可以听牌，胡牌。"},
    [39] = {name = "，数页",          des = "<#ff0000><30>【数页】<#46200F><30>数页：针对庄家计算数页的分数。"},
    [45] = {name = "，双耗子",          des = "<#ff0000><30>【双耗子】<#46200F><30>玩家勾选选项后，玩法增加两种耗子牌（随机）。"}, 
    [46] = {name = "，庄算分",          des = "<#ff0000><30>【庄算分】<#46200F><30>庄算分：勾选选项后，结算时庄算10分。"}, 
    [48] = {name = "，免碰",          des = "<#ff0000><30>【免碰】<#46200F><30>免碰：麻将不允许碰牌。"}, 
    [49] = {name = "，风耗子",        des = "<#ff0000><30>【风耗子】<#46200F><30>玩家勾选选项后，玩法增加耗子牌（风）。"},
    [50] = {name = "，硬八张",        des = "<#ff0000><30>【硬八张】<#46200F><30>硬八张：胡牌时必须有一门牌数大于8张。"},
    [52] = {name = "，荒庄轮庄",      des = "<#ff0000><30>【荒庄轮庄】<#46200F><30>荒庄轮庄：荒庄后下家坐庄。"},
    [53] = {name = "，缺一门",      des = "<#ff0000><30>缺一门<#46200F><30>缺一门：玩法增加缺一门。"},
    [54] = {name = "，高分(平胡5分）",        des = "<#ff0000><30>【高分(平胡5分）】<#46200F><30>玩家勾选选项后，玩法增加高分。"},
    [55] = {name = "，红中癞子",        des = "<#ff0000><30>【红中癞子】<#46200F><30>玩家勾选选项后，玩法增加红中癞子。"},
    
    [10001] = {name = "，平胡",       des = "推倒胡"},
    [10002] = {name = "，大胡",       des = "推倒胡"},

    [100001] = {name = "，推倒胡",     des = "推倒胡"},
    [100002] = {name = "，扣点点",       des = "扣点点"},
    [100003] = {name = "，运城贴金",    des = "运城贴金"},
    [100004] = {name = "，立四",       des = "立四"},
    [100005] = {name = "，晋中",       des = "晋中"},
    [100006] = {name = "，拐三角",      des = "拐三角"},   
    [100008] = {name = "，硬三嘴",      des = "硬三嘴"},
    [100009] = {name = "，洪洞王牌",      des = "洪洞王牌"},
    [100010] = {name = "，一门牌",      des = "一门牌"},
    [100016] = {name = "，忻州扣点点",       des = "忻州扣点点"},

    [100012] = {name = "，二人扣点点",    des = "二人扣点点"},
    [100013] = {name = "，三人扣点点",    des = "三人扣点点"},

    [100014] = {name = "，二人推倒胡",    des = "二人推倒胡"},
    [100015] = {name = "，三人推倒胡",    des = "三人推倒胡"},

    [102005] = {name = "，二人晋中",    des = "二人晋中"},
    [103005] = {name = "，三人晋中",    des = "三人晋中"},

    [102008] = {name = "，二人硬三嘴",    des = "二人硬三嘴"},
    [103008] = {name = "，三人硬三嘴",    des = "三人硬三嘴"},

    [102009] = {name = "，二人洪洞王牌",    des = "二人洪洞王牌"},
    [103009] = {name = "，三人洪洞王牌",    des = "三人洪洞王牌"},

    [102010] = {name = "，二人一门牌",    des = "二人一门牌"},
    [103010] = {name = "，三人一门牌",    des = "三人一门牌"},
    [100018] = {name = ", 陵川靠八张",    des = "陵川靠八张"},
}

--大玩法之小选项分类
MJRules.GroupType = {
    --推到胡
    [1] = {1,2,18,3,55},
    --扣点点
    [2] = {4,5,49,6,45,18},
    --立四
    [3] = {8,18},
    --晋中
    -- [4] = {13,15,16,17,7,9,12,14,18},
    [4] = {},
    --贴金
    [5] = {21,22,13,20,16,19,23,18},
    --拐三角
    [6] = {2,18,54},
    --硬三嘴
    [7] = {28,18},
    --洪洞王牌
    [8] = {48,18,9,34},
    --一门牌
    [9] = {28,18,39},
    --二人扣点点
    [10] = {4,5,49,6,45,18},
    --三人扣点点
    [11] = {4,5,49,6,45,18},
    --二人推倒胡
    [12] = {1,2,18,3},
    --三人推倒胡
    [13] = {1,2,18,3},
    --忻州扣点点
    [14] = {53, 18},
    --临汾撵中子
    [15] = {18},
}

--耗子牌分类显示
MJRules.HaoziGroup = {
    [1] = {6,7,8,9,10,11,18,48,17},   --单耗子
    [2] = {45,7,8,9,10,11,18,},   --双耗子
}

MJRules.HuPaiType = {
    [10001] = "平胡",
    [1003] = "七小对",
    [1004] = "豪华七小对",
    [1005] = "清一色",
    [1006] = "一条龙",
    [1007] = "十三幺",
    [1010] = "缺门",
    [1011] = "边张",
    [1012] = "坎张",
    [1013] = "吊张",
    [1021] = "凑一色",
    [1022] = "风一色",
    [1023] = "门清",
    [1024] = "断幺",
    [1025] = "碰碰胡",
    [1026] = "坎胡",
    [1027] = "青龙",
    [1028] = "清七对",
    [1029] = "字一色",
    [1030] = "清豪华七小对",
    [1031] = "缺一门", 
    [1032] = "色牌",
    [1033] = "孤将",
    [1034] = "一张赢", 
    [1035] = "单吊",
    [1041] = "三风X1", 
    [1042] = "三风X2",
    [1043] = "三风X3",
    [1044] = "三风X4",
    [1051] = "三元X1",
    [1052] = "三元X2",
    [1053] = "三元X3",
    [1054] = "三元X4", 
    [1055] = "楼上楼",
    [1056] = "硬扣",
    [1057] = "吊王",
    [1058] = "连庄",
}





